## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/a38460e185b8ec52cead39453fa1db73c4ea9512" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/a38460e185b8ec52cead39453fa1db73c4ea9512" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJWEFYQTZPZFJRWTB3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQXpPVFF5TnpjM01qYzVOREUwTkRRek9EVTFNQ0FYRFRJeU1Ea3hOekUyTVRrME5Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1ETTVOREkzTnpjeU56azBNVFEwTkRNNE5UVXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRFgzeGZEb2dSN3Q3aFlPY3laYmp1dmFMelYKaGtTTWVCbGtFVU5iZ2l0cFg2UjA5OWxPSlIrTXlBM3NYSVZmUXIyTE5oa3dQK2RwSHdUM3YwKzJ5NXgvRjRlMwpOZGUycEh3ajBKalNDWFZFSEw3K0tIOFNJVUZpdkpGNWRYNGl1NGdDbGZrSFQ4RzgySG1BVGlHbE45SVpsNk92CmtLdnY1MnBpZEFEaS80TDU5L2hPdW5lTExzdHlYUGFVRkJQTFoyNWI1NVRjZjNMTDVVQjdDVDlvemVGZFc2U2gKK1I4ZlF2bUVhWStLUnJ0dmFBWW1veHpiaU5EOC8rdHFjNVFGSlkrWFpFb0NTZ0VEV1YyWW4zRjJWSHlLUW5SYwo5OUpPZlZGZHlOZ280RUpjdTE0M1UzN09sbzNhdWUzUEs0ZmpDckRGalIvWXdLc3JDY1gxR3Aybk5Hd1ZBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQU5kVkZBelV5ZFFJN25RRTBYS2M5RQo3aUcrS2tyZlg4M0tLcjE1dHBMTDJNbVRsNUd3QkNteVY2aU9TYW8veUM5dExQdXJxTGd2RHN2OGdNdDJmd0FyCi9kTzd1SW42aW5qdDFvTmd0YlZ4Yi8yVnJQOXMxK0I3ZGlCUis1VXlFNEhuRjFnVzJpckVzdERJejJSUWhUVmUKanBqMDNLV2IvZDcwbHZNRlhLOVM5SUx0c21USS9QR0VMNXZQeVBUYkZnZmxQOW5yNVZ5a1dMT3J2QncxTXR2aApPVFg3RGU0YTVPMHhCaUE3OXdoRk5GL2pSUUZ5cmszb0R1S2NjNVQyWjRTY1BtVllwdTlzdkFVNXBWa1ZCbExaCmpLZkNsb2liekVpUVdGeUE4S2w0cmJwYlg2VnYraW51dW5JWDhuTVRWcDd5Q2NVeVZTZVFIV0t4dENvbUZnQnQKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-17T16:19:44Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.external_dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:external-dns@terrateam-362405.iam.gserviceaccount.com"
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

Plan: 6 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
